a = int(input("Введите первое число: "))
if a>=1 & a<=3:
    print(f"Число {a} принадлежит интервалу [1, 3]")
else:
    print(f"Число {a} не принадлежит интервалу [1, 3]")
a = int(input("Введите первое число: "))
if a>=1 | a<=3:
    print(f"Число {a} принадлежит интервалу [1, 3]")
else:
    print(f"Число {a} не принадлежит интервалу [1, 3]")
a = int(input("Введите первое число: "))
if a>=1 | a<=3:
    print(f"Число {a} принадлежит интервалу [1, 3]")
else:
    print(f"Число {a} не принадлежит интервалу [1, 3]")